tests/artillery/search.yaml
config:
  target: 'GET http://candy-store.test'
  phases:
    - duration: 1
      arrivalRate: 1
  defaults:
    headers:
      Authorization: 'Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImp0aSI6IjdhZTY4MjUwZDRlMzQ1NmY3MDRjYjFkM2I5OTE0MDM4YzhmYjg5MDRhM2EyYzc5NzdkMWNiZGNhY2M3NTYzMGRhYjgyNDEzYzQxODJmMTI0In0.eyJhdWQiOiIyIiwianRpIjoiN2FlNjgyNTBkNGUzNDU2ZjcwNGNiMWQzYjk5MTQwMzhjOGZiODkwNGEzYTJjNzk3N2QxY2JkY2FjYzc1NjMwZGFiODI0MTNjNDE4MmYxMjQiLCJpYXQiOjE1MTk3MzAwMzUsIm5iZiI6MTUxOTczMDAzNSwiZXhwIjoxNTE5NzMzNjM1LCJzdWIiOiI3Iiwic2NvcGVzIjpbXX0.L7H7cz8VzeUpSWECVhEIkHuEubkQmBo6zg95ejDh-3GVSKS8t3knIPLj-N4KK3ooEFO9iyPoEdMr4z-R8emyKlTgbXuyA9AUfkJqySOTeTX4ixH3UE5pgsAnUE6Zi3a7jabyHXwtFkpofk8OnUFbCGevySDL8B26uX8JCK9a_9Nly6SIPHz3nNTauwZTDoKjfJykEBy5yd8F55yPPRrS8jGSNqlL5g3WxvMzLKrnXQoZvsJe5yrP9JnKb-9Gwk4lfcPsaLUVIMXneVbN-XYT5n1MPKDjnp4KXHXJzCM5Vi__iqyEIa3iF4Z5Su3-tqkUuydXHQdzpmFLRmYoqCu5TlnnY9lLSy3WVCqyDMHQeMn4C3-qIBSRzZErdDLtzEW4lbe5XybugBmZsNPEGEu2u7FBfWRLWUF64d8_ejVWfginNL5mWdw7f_vhQcX9TiA8woo7JK07GoWRXzN1Nh60_xfutQc-PUVOrXwe78WrREhPAV6sXBlCSlkI8A6u1zLAizwQEQbPWOGnG9dikBGnrjlBHT5tReu3g1MNchNRiFesh6jbGwzod1ohaVttPqmCS3jA89qade9JWXfrBPbOW8Suy2ePD4DADqKzJxY8DBYAF8mZr8fbJoH6F5FqTqEizNouNGp_naeabLxKYbxK1GEVITqQZpJLjSs7mXxE82A'
scenarios:
  - flow:
    - get:
        url: "/api/v1/search?type=product&includes=first_variant&channel=Get Candy&per_page=10&sort_by%5Bcreated_at%5D=desc"